app/views/visitors/index.html.erb

SELECT COUNT(*) FROM `users`
---
<%= image_tag "logo_ubiqube.jpg", alt:"UbiQube logo", class: "image-index" %>
<p><%= link_to 'Users:', users_path %> <%= User.count%> registered</p>