app/views/users/_mesapps.html.erb

SELECT `apps`.* FROM `apps` INNER JOIN `user_app_roles` `user_app_roles_apps_join` ON `user_app_roles_apps_join`.`app_id` = `apps`.`id` INNER JOIN `roles` ON `roles`.`id` = `user_app_roles_apps_join`.`role_id` INNER JOIN `user_app_roles` ON `apps`.`id` = `user_app_roles`.`app_id` WHERE `user_app_roles`.`user_id` = 1
---
          </tr>
          <tr><td>Groupe</td><td><%= a.apps.groupe_app.nom%></td>