app/views/apps/_form.html.erb

    </tr>
    <p><%= f.label :groupe %><%= f.text_field @app.groupe_app.nom%></td>
---
SELECT `etat_apps`.* FROM `etat_apps`
SELECT `groupe_apps`.* FROM `groupe_apps`