app/views/apps/_form_fonc.html.erb

SELECT `etat_apps`.* FROM `etat_apps`
SELECT `etape_apps`.* FROM `etape_apps`
SELECT `groupe_apps`.* FROM `groupe_apps`
---

    <%= f.label :etat %><%= f.select :etat_app_id, EtatApp.all.map { |etat_app| [etat_app.nom, etat_app.id] }, {:prompt => true}, {:class=>'form-control input-sm'}%>
    <%= f.label :etape %><%= f.select :etape_app_id, EtapeApp.all.map { |etape_app| [etape_app.nom, etape_app.id] }, {:prompt => true}, {:class=>'form-control input-sm'}%>
    <%= f.label :groupe %><%= f.select :groupe_app_id, GroupeApp.all.map { |groupe_app| [groupe_app.nom, groupe_app.id] }, {:prompt => true}, {:class=>'form-control input-sm'}%>