app/controllers/apps_controller.rb

  def show
    @app = App.find(params[:id])
---
SELECT  `apps`.* FROM `apps`  WHERE `apps`.`id` = 1 LIMIT 1

  def edit
    @app=App.find(params[:id])
---
SELECT  `apps`.* FROM `apps`  WHERE `apps`.`id` = 1 LIMIT 1

  def edit_tech
    @app=App.find(params[:id])
---
SELECT  `apps`.* FROM `apps`  WHERE `apps`.`id` = 23 LIMIT 1

  def create
    #app_params.permit!

    @app=App.new(app_params)

    #@app.build(params[:user_app_roles])
    #@app.user_app_roles=UserAppRole.new(params[:user_app_roles])
    #@app.user_app_roles.build(params[:app_id])
    #@app.user_app_roles＝@user_app_roles
    #@app.build(params[:user_app_roles])
    #@app.build(params[:user_app_roles])
    #@app.build(params[:user_app_roles])

    respond_to do |format|
      if @app.save
---
INSERT INTO `apps` (`created_at`, `description`, `etape_app_id`, `etat_app_id`, `nom`, `updated_at`) VALUES ('2015-06-26 12:55:24', 'srsd', 1, 1, 'rgrs', '2015-06-26 12:55:24')

  def destroy
    @app = App.find(params[:id])
    if @app.destroy then
---
SELECT  `apps`.* FROM `apps`  WHERE `apps`.`id` = 2 LIMIT 1
DELETE FROM `apps` WHERE `apps`.`id` = 2