app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-20 08:28:19.213707"], ["name", ""], ["provider", "cas"], ["uid", "beuneche"], ["updated_at", "2014-11-20 08:28:19.213707"]]
SELECT  `users`.* FROM `users`  WHERE `users`.`provider` = 'cas' AND `users`.`uid` = 'beuneche'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
      auth = request.env["omniauth.auth"]
      ldap_user=ldap_auth(auth['uid'])
      if ldap_user
        user = User.where(:provider => auth['provider'],
                          :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)