app/controllers/users_controller.rb

  def index

    require 'net/ldap'
    ldap = Net::LDAP.new :host => "ldap.univ-tours.fr",
     :port => 389,
     :auth => {
           :method => :simple,
           :username => "cn=rails_conn,ou=applis,dc=univ-tours,dc=fr",
           :password => "s4cor;7Xvk2qSdrq"
    }

  if ldap.bind
    #filter = Net::LDAP::Filter.eq( "uid", current_user[:uid] )
    filter = Net::LDAP::Filter.eq( "UFRComposante", "DTIC" )
    treebase = "ou=people,dc=univ-tours,dc=fr"
    @results = ldap.search( :base => treebase, :filter => filter )
  else
      # authentication failed
	logger.debug("non")
  end

  @users = User.all
---
SELECT `users`.* FROM `users`

  def mesapps
    @user = User.find(session[:user_id])
    @mesapps=@user.user_app_roles.includes(:apps,:roles)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1
SELECT `apps`.* FROM `apps` INNER JOIN `user_app_roles` `user_app_roles_apps_join` ON `user_app_roles_apps_join`.`app_id` = `apps`.`id` INNER JOIN `roles` ON `roles`.`id` = `user_app_roles_apps_join`.`role_id` INNER JOIN `user_app_roles` ON `apps`.`id` = `user_app_roles`.`app_id` WHERE `user_app_roles`.`user_id` = 1
SELECT `roles`.* FROM `roles`  WHERE `roles`.`id` IN (1)
SELECT `user_app_roles`.* FROM `user_app_roles`  WHERE `user_app_roles`.`user_id` = 1